GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.inc
// Register: IPR4
#define IPR4 IPR4
IPR4                                     equ 036Bh
// bitfield definitions
IPR4_U1RXIP_POSN                         equ 0000h
IPR4_U1RXIP_POSITION                     equ 0000h
IPR4_U1RXIP_SIZE                         equ 0001h
IPR4_U1RXIP_LENGTH                       equ 0001h
IPR4_U1RXIP_MASK                         equ 0001h
IPR4_U1TXIP_POSN                         equ 0001h
IPR4_U1TXIP_POSITION                     equ 0001h
IPR4_U1TXIP_SIZE                         equ 0001h
IPR4_U1TXIP_LENGTH                       equ 0001h
IPR4_U1TXIP_MASK                         equ 0002h
IPR4_U1EIP_POSN                          equ 0002h
IPR4_U1EIP_POSITION                      equ 0002h
IPR4_U1EIP_SIZE                          equ 0001h
IPR4_U1EIP_LENGTH                        equ 0001h
IPR4_U1EIP_MASK                          equ 0004h
IPR4_U1IP_POSN                           equ 0003h
IPR4_U1IP_POSITION                       equ 0003h
IPR4_U1IP_SIZE                           equ 0001h
IPR4_U1IP_LENGTH                         equ 0001h
IPR4_U1IP_MASK                           equ 0008h
IPR4_TMR3IP_POSN                         equ 0004h
IPR4_TMR3IP_POSITION                     equ 0004h
IPR4_TMR3IP_SIZE                         equ 0001h
IPR4_TMR3IP_LENGTH                       equ 0001h
IPR4_TMR3IP_MASK                         equ 0010h
IPR4_TMR3GIP_POSN                        equ 0005h
IPR4_TMR3GIP_POSITION                    equ 0005h
IPR4_TMR3GIP_SIZE                        equ 0001h
IPR4_TMR3GIP_LENGTH                      equ 0001h
IPR4_TMR3GIP_MASK                        equ 0020h
IPR4_PWM1PIP_POSN                        equ 0006h
IPR4_PWM1PIP_POSITION                    equ 0006h
IPR4_PWM1PIP_SIZE                        equ 0001h
IPR4_PWM1PIP_LENGTH                      equ 0001h
IPR4_PWM1PIP_MASK                        equ 0040h
IPR4_PWM1IP_POSN                         equ 0007h
IPR4_PWM1IP_POSITION                     equ 0007h
IPR4_PWM1IP_SIZE                         equ 0001h
IPR4_PWM1IP_LENGTH                       equ 0001h
IPR4_PWM1IP_MASK                         equ 0080h

// Register: IPR5
#define IPR5 IPR5
IPR5                                     equ 036Ch
// bitfield definitions
IPR5_SPI2RXIP_POSN                       equ 0000h
IPR5_SPI2RXIP_POSITION                   equ 0000h
IPR5_SPI2RXIP_SIZE                       equ 0001h
IPR5_SPI2RXIP_LENGTH                     equ 0001h
IPR5_SPI2RXIP_MASK                       equ 0001h
IPR5_SPI2TXIP_POSN                       equ 0001h
IPR5_SPI2TXIP_POSITION                   equ 0001h
IPR5_SPI2TXIP_SIZE                       equ 0001h
IPR5_SPI2TXIP_LENGTH                     equ 0001h
IPR5_SPI2TXIP_MASK                       equ 0002h
IPR5_SPI2IP_POSN                         equ 0002h
IPR5_SPI2IP_POSITION                     equ 0002h
IPR5_SPI2IP_SIZE                         equ 0001h
IPR5_SPI2IP_LENGTH                       equ 0001h
IPR5_SPI2IP_MASK                         equ 0004h
IPR5_C2IP_POSN                           equ 0004h
IPR5_C2IP_POSITION                       equ 0004h
IPR5_C2IP_SIZE                           equ 0001h
IPR5_C2IP_LENGTH                         equ 0001h
IPR5_C2IP_MASK                           equ 0010h
IPR5_CLC2IP_POSN                         equ 0005h
IPR5_CLC2IP_POSITION                     equ 0005h
IPR5_CLC2IP_SIZE                         equ 0001h
IPR5_CLC2IP_LENGTH                       equ 0001h
IPR5_CLC2IP_MASK                         equ 0020h
IPR5_PWM2PIP_POSN                        equ 0006h
IPR5_PWM2PIP_POSITION                    equ 0006h
IPR5_PWM2PIP_SIZE                        equ 0001h
IPR5_PWM2PIP_LENGTH                      equ 0001h
IPR5_PWM2PIP_MASK                        equ 0040h
IPR5_PWM2IP_POSN                         equ 0007h
IPR5_PWM2IP_POSITION                     equ 0007h
IPR5_PWM2IP_SIZE                         equ 0001h
IPR5_PWM2IP_LENGTH                       equ 0001h
IPR5_PWM2IP_MASK                         equ 0080h
IPR5_CM2IP_POSN                          equ 0004h
IPR5_CM2IP_POSITION                      equ 0004h
IPR5_CM2IP_SIZE                          equ 0001h
IPR5_CM2IP_LENGTH                        equ 0001h
IPR5_CM2IP_MASK                          equ 0010h

// Register: IPR6
#define IPR6 IPR6
IPR6                                     equ 036Dh
// bitfield definitions
IPR6_INT1IP_POSN                         equ 0000h
IPR6_INT1IP_POSITION                     equ 0000h
IPR6_INT1IP_SIZE                         equ 0001h
IPR6_INT1IP_LENGTH                       equ 0001h
IPR6_INT1IP_MASK                         equ 0001h
IPR6_CWG1IP_POSN                         equ 0002h
IPR6_CWG1IP_POSITION                     equ 0002h
IPR6_CWG1IP_SIZE                         equ 0001h
IPR6_CWG1IP_LENGTH                       equ 0001h
IPR6_CWG1IP_MASK                         equ 0004h
IPR6_NCO1IP_POSN                         equ 0003h
IPR6_NCO1IP_POSITION                     equ 0003h
IPR6_NCO1IP_SIZE                         equ 0001h
IPR6_NCO1IP_LENGTH                       equ 0001h
IPR6_NCO1IP_MASK                         equ 0008h
IPR6_DMA2SCNTIP_POSN                     equ 0004h
IPR6_DMA2SCNTIP_POSITION                 equ 0004h
IPR6_DMA2SCNTIP_SIZE                     equ 0001h
IPR6_DMA2SCNTIP_LENGTH                   equ 0001h
IPR6_DMA2SCNTIP_MASK                     equ 0010h
IPR6_DMA2DCNTIP_POSN                     equ 0005h
IPR6_DMA2DCNTIP_POSITION                 equ 0005h
IPR6_DMA2DCNTIP_SIZE                     equ 0001h
IPR6_DMA2DCNTIP_LENGTH                   equ 0001h
IPR6_DMA2DCNTIP_MASK                     equ 0020h
IPR6_DMA2ORIP_POSN                       equ 0006h
IPR6_DMA2ORIP_POSITION                   equ 0006h
IPR6_DMA2ORIP_SIZE                       equ 0001h
IPR6_DMA2ORIP_LENGTH                     equ 0001h
IPR6_DMA2ORIP_MASK                       equ 0040h
IPR6_DMA2AIP_POSN                        equ 0007h
IPR6_DMA2AIP_POSITION                    equ 0007h
IPR6_DMA2AIP_SIZE                        equ 0001h
IPR6_DMA2AIP_LENGTH                      equ 0001h
IPR6_DMA2AIP_MASK                        equ 0080h

// Register: IPR7
#define IPR7 IPR7
IPR7                                     equ 036Eh
// bitfield definitions
IPR7_I2C1RXIP_POSN                       equ 0000h
IPR7_I2C1RXIP_POSITION                   equ 0000h
IPR7_I2C1RXIP_SIZE                       equ 0001h
IPR7_I2C1RXIP_LENGTH                     equ 0001h
IPR7_I2C1RXIP_MASK                       equ 0001h
IPR7_I2C1TXIP_POSN                       equ 0001h
IPR7_I2C1TXIP_POSITION                   equ 0001h
IPR7_I2C1TXIP_SIZE                       equ 0001h
IPR7_I2C1TXIP_LENGTH                     equ 0001h
IPR7_I2C1TXIP_MASK                       equ 0002h
IPR7_I2C1IP_POSN                         equ 0002h
IPR7_I2C1IP_POSITION                     equ 0002h
IPR7_I2C1IP_SIZE                         equ 0001h
IPR7_I2C1IP_LENGTH                       equ 0001h
IPR7_I2C1IP_MASK                         equ 0004h
IPR7_I2C1EIP_POSN                        equ 0003h
IPR7_I2C1EIP_POSITION                    equ 0003h
IPR7_I2C1EIP_SIZE                        equ 0001h
IPR7_I2C1EIP_LENGTH                      equ 0001h
IPR7_I2C1EIP_MASK                        equ 0008h
IPR7_CLC3IP_POSN                         equ 0005h
IPR7_CLC3IP_POSITION                     equ 0005h
IPR7_CLC3IP_SIZE                         equ 0001h
IPR7_CLC3IP_LENGTH                       equ 0001h
IPR7_CLC3IP_MASK                         equ 0020h
IPR7_PWM3PIP_POSN                        equ 0006h
IPR7_PWM3PIP_POSITION                    equ 0006h
IPR7_PWM3PIP_SIZE                        equ 0001h
IPR7_PWM3PIP_LENGTH                      equ 0001h
IPR7_PWM3PIP_MASK                        equ 0040h
IPR7_PWM3IP_POSN                         equ 0007h
IPR7_PWM3IP_POSITION                     equ 0007h
IPR7_PWM3IP_SIZE                         equ 0001h
IPR7_PWM3IP_LENGTH                       equ 0001h
IPR7_PWM3IP_MASK                         equ 0080h

// Register: IPR8
#define IPR8 IPR8
IPR8                                     equ 036Fh
// bitfield definitions
IPR8_U2RXIP_POSN                         equ 0000h
IPR8_U2RXIP_POSITION                     equ 0000h
IPR8_U2RXIP_SIZE                         equ 0001h
IPR8_U2RXIP_LENGTH                       equ 0001h
IPR8_U2RXIP_MASK                         equ 0001h
IPR8_U2TXIP_POSN                         equ 0001h
IPR8_U2TXIP_POSITION                     equ 0001h
IPR8_U2TXIP_SIZE                         equ 0001h
IPR8_U2TXIP_LENGTH                       equ 0001h
IPR8_U2TXIP_MASK                         equ 0002h
IPR8_U2EIP_POSN                          equ 0002h
IPR8_U2EIP_POSITION                      equ 0002h
IPR8_U2EIP_SIZE                          equ 0001h
IPR8_U2EIP_LENGTH                        equ 0001h
IPR8_U2EIP_MASK                          equ 0004h
IPR8_U2IP_POSN                           equ 0003h
IPR8_U2IP_POSITION                       equ 0003h
IPR8_U2IP_SIZE                           equ 0001h
IPR8_U2IP_LENGTH                         equ 0001h
IPR8_U2IP_MASK                           equ 0008h
IPR8_CLC4IP_POSN                         equ 0005h
IPR8_CLC4IP_POSITION                     equ 0005h
IPR8_CLC4IP_SIZE                         equ 0001h
IPR8_CLC4IP_LENGTH                       equ 0001h
IPR8_CLC4IP_MASK                         equ 0020h
IPR8_SCANIP_POSN                         equ 0007h
IPR8_SCANIP_POSITION                     equ 0007h
IPR8_SCANIP_SIZE                         equ 0001h
IPR8_SCANIP_LENGTH                       equ 0001h
IPR8_SCANIP_MASK                         equ 0080h

// Register: IPR9
#define IPR9 IPR9
IPR9                                     equ 0370h
// bitfield definitions
IPR9_U3RXIP_POSN                         equ 0000h
IPR9_U3RXIP_POSITION                     equ 0000h
IPR9_U3RXIP_SIZE                         equ 0001h
IPR9_U3RXIP_LENGTH                       equ 0001h
IPR9_U3RXIP_MASK                         equ 0001h
IPR9_U3TXIP_POSN                         equ 0001h
IPR9_U3TXIP_POSITION                     equ 0001h
IPR9_U3TXIP_SIZE                         equ 0001h
IPR9_U3TXIP_LENGTH                       equ 0001h
IPR9_U3TXIP_MASK                         equ 0002h
IPR9_U3EIP_POSN                          equ 0002h
IPR9_U3EIP_POSITION                      equ 0002h
IPR9_U3EIP_SIZE                          equ 0001h
IPR9_U3EIP_LENGTH                        equ 0001h
IPR9_U3EIP_MASK                          equ 0004h
IPR9_U3IP_POSN                           equ 0003h
IPR9_U3IP_POSITION                       equ 0003h
IPR9_U3IP_SIZE                           equ 0001h
IPR9_U3IP_LENGTH                         equ 0001h
IPR9_U3IP_MASK                           equ 0008h
IPR9_DMA3SCNTIP_POSN                     equ 0004h
IPR9_DMA3SCNTIP_POSITION                 equ 0004h
IPR9_DMA3SCNTIP_SIZE                     equ 0001h
IPR9_DMA3SCNTIP_LENGTH                   equ 0001h
IPR9_DMA3SCNTIP_MASK                     equ 0010h
IPR9_DMA3DCNTIP_POSN                     equ 0005h
IPR9_DMA3DCNTIP_POSITION                 equ 0005h
IPR9_DMA3DCNTIP_SIZE                     equ 0001h
IPR9_DMA3DCNTIP_LENGTH                   equ 0001h
IPR9_DMA3DCNTIP_MASK                     equ 0020h
IPR9_DMA3ORIP_POSN                       equ 0006h
IPR9_DMA3ORIP_POSITION                   equ 0006h
IPR9_DMA3ORIP_SIZE                       equ 0001h
IPR9_DMA3ORIP_LENGTH                     equ 0001h
IPR9_DMA3ORIP_MASK                       equ 0040h
IPR9_DMA3AIP_POSN                        equ 0007h
IPR9_DMA3AIP_POSITION                    equ 0007h
IPR9_DMA3AIP_SIZE                        equ 0001h
IPR9_DMA3AIP_LENGTH                      equ 0001h
IPR9_DMA3AIP_MASK                        equ 0080h

// Register: IPR10
#define IPR10 IPR10
IPR10                                    equ 0371h
// bitfield definitions
IPR10_INT2IP_POSN                        equ 0000h
IPR10_INT2IP_POSITION                    equ 0000h
IPR10_INT2IP_SIZE                        equ 0001h
IPR10_INT2IP_LENGTH                      equ 0001h
IPR10_INT2IP_MASK                        equ 0001h
IPR10_TMR4IP_POSN                        equ 0003h
IPR10_TMR4IP_POSITION                    equ 0003h
IPR10_TMR4IP_SIZE                        equ 0001h
IPR10_TMR4IP_LENGTH                      equ 0001h
IPR10_TMR4IP_MASK                        equ 0008h
IPR10_DMA4SCNTIP_POSN                    equ 0004h
IPR10_DMA4SCNTIP_POSITION                equ 0004h
IPR10_DMA4SCNTIP_SIZE                    equ 0001h
IPR10_DMA4SCNTIP_LENGTH                  equ 0001h
IPR10_DMA4SCNTIP_MASK                    equ 0010h
IPR10_DMA4DCNTIP_POSN                    equ 0005h
IPR10_DMA4DCNTIP_POSITION                equ 0005h
IPR10_DMA4DCNTIP_SIZE                    equ 0001h
IPR10_DMA4DCNTIP_LENGTH                  equ 0001h
IPR10_DMA4DCNTIP_MASK                    equ 0020h
IPR10_DMA4ORIP_POSN                      equ 0006h
IPR10_DMA4ORIP_POSITION                  equ 0006h
IPR10_DMA4ORIP_SIZE                      equ 0001h
IPR10_DMA4ORIP_LENGTH                    equ 0001h
IPR10_DMA4ORIP_MASK                      equ 0040h
IPR10_DMA4AIP_POSN                       equ 0007h
IPR10_DMA4AIP_POSITION                   equ 0007h
IPR10_DMA4AIP_SIZE                       equ 0001h
IPR10_DMA4AIP_LENGTH                     equ 0001h
IPR10_DMA4AIP_MASK                       equ 0080h

// Register: STATUS_CSHAD
#define STATUS_CSHAD STATUS_CSHAD
STATUS_CSHAD                             equ 0373h
// bitfield definitions
STATUS_CSHAD_NOT_PD_POSN                 equ 0005h
STATUS_CSHAD_NOT_PD_POSITION             equ 0005h
STATUS_CSHAD_NOT_PD_SIZE                 equ 0001h
STATUS_CSHAD_NOT_PD_LENGTH               equ 0001h
STATUS_CSHAD_NOT_PD_MASK                 equ 0020h
STATUS_CSHAD_NOT_TO_POSN                 equ 0006h
STATUS_CSHAD_NOT_TO_POSITION             equ 0006h
STATUS_CSHAD_NOT_TO_SIZE                 equ 0001h
STATUS_CSHAD_NOT_TO_LENGTH               equ 0001h
STATUS_CSHAD_NOT_TO_MASK                 equ 0040h
STATUS_CSHAD_C_POSN                      equ 0000h
STATUS_CSHAD_C_POSITION                  equ 0000h
STATUS_CSHAD_C_SIZE                      equ 0001h
STATUS_CSHAD_C_LENGTH                    equ 0001h
STATUS_CSHAD_C_MASK                      equ 0001h
STATUS_CSHAD_DC_POSN                     equ 0001h
STATUS_CSHAD_DC_POSITION                 equ 0001h
STATUS_CSHAD_DC_SIZE                     equ 0001h
STATUS_CSHAD_DC_LENGTH                   equ 0001h
STATUS_CSHAD_DC_MASK                     equ 0002h
STATUS_CSHAD_Z_POSN                      equ 0002h
STATUS_CSHAD_Z_POSITION                  equ 0002h
STATUS_CSHAD_Z_SIZE                      equ 0001h
STATUS_CSHAD_Z_LENGTH                    equ 0001h
STATUS_CSHAD_Z_MASK                      equ 0004h
STATUS_CSHAD_OV_POSN                     equ 0003h
STATUS_CSHAD_OV_POSITION                 equ 0003h
STATUS_CSHAD_OV_SIZE                     equ 0001h
STATUS_CSHAD_OV_LENGTH                   equ 0001h
STATUS_CSHAD_OV_MASK                     equ 0008h
STATUS_CSHAD_N_POSN                      equ 0004h
STATUS_CSHAD_N_POSITION                  equ 0004h
STATUS_CSHAD_N_SIZE                      equ 0001h
STATUS_CSHAD_N_LENGTH                    equ 0001h
STATUS_CSHAD_N_MASK                      equ 0010h
STATUS_CSHAD_nPD_POSN                    equ 0005h
STATUS_CSHAD_nPD_POSITION                equ 0005h
STATUS_CSHAD_nPD_SIZE                    equ 0001h
STATUS_CSHAD_nPD_LENGTH                  equ 0001h
STATUS_CSHAD_nPD_MASK                    equ 0020h
STATUS_CSHAD_nTO_POSN                    equ 0006h
STATUS_CSHAD_nTO_POSITION                equ 0006h
STATUS_CSHAD_nTO_SIZE                    equ 0001h
STATUS_CSHAD_nTO_LENGTH                  equ 0001h
STATUS_CSHAD_nTO_MASK                    equ 0040h
STATUS_CSHAD_PD_POSN                     equ 0005h
STATUS_CSHAD_PD_POSITION                 equ 0005h
STATUS_CSHAD_PD_SIZE                     equ 0001h
STATUS_CSHAD_PD_LENGTH                   equ 0001h
STATUS_CSHAD_PD_MASK                     equ 0020h
STATUS_CSHAD_TO_POSN                     equ 0006h
STATUS_CSHAD_TO_POSITION                 equ 0006h
STATUS_CSHAD_TO_SIZE                     equ 0001h
STATUS_CSHAD_TO_LENGTH                   equ 0001h
STATUS_CSHAD_TO_MASK                     equ 0040h

// Register: WREG_CSHAD
#define WREG_CSHAD WREG_CSHAD
WREG_CSHAD                               equ 0374h
// bitfield definitions
WREG_CSHAD_WREG_POSN                     equ 0000h
WREG_CSHAD_WREG_POSITION                 equ 0000h
WREG_CSHAD_WREG_SIZE                     equ 0008h
WREG_CSHAD_WREG_LENGTH                   equ 0008h
WREG_CSHAD_WREG_MASK                     equ 00FFh

// Register: BSR_CSHAD
#define BSR_CSHAD BSR_CSHAD
BSR_CSHAD                                equ 0375h

// Register: SHADCON
#define SHADCON SHADCON
SHADCON                                  equ 0376h
// bitfield definitions
SHADCON_SHADLO_POSN                      equ 0000h
SHADCON_SHADLO_POSITION                  equ 0000h
SHADCON_SHADLO_SIZE                      equ 0001h
SHADCON_SHADLO_LENGTH                    equ 0001h
SHADCON_SHADLO_MASK                      equ 0001h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 0377h
// bitfield definitions
STATUS_SHAD_NOT_PD_POSN                  equ 0005h
STATUS_SHAD_NOT_PD_POSITION              equ 0005h
STATUS_SHAD_NOT_PD_SIZE                  equ 0001h
STATUS_SHAD_NOT_PD_LENGTH                equ 0001h
STATUS_SHAD_NOT_PD_MASK                  equ 0020h
STATUS_SHAD_NOT_TO_POSN                  equ 0006h
STATUS_SHAD_NOT_TO_POSITION              equ 0006h
STATUS_SHAD_NOT_TO_SIZE                  equ 0001h
STATUS_SHAD_NOT_TO_LENGTH                equ 0001h
STATUS_SHAD_NOT_TO_MASK                  equ 0040h
STATUS_SHAD_C_POSN                       equ 0000h
STATUS_SHAD_C_POSITION                   equ 0000h
STATUS_SHAD_C_SIZE                       equ 0001h
STATUS_SHAD_C_LENGTH                     equ 0001h
STATUS_SHAD_C_MASK                       equ 0001h
STATUS_SHAD_DC_POSN                      equ 0001h
STATUS_SHAD_DC_POSITION                  equ 0001h
STATUS_SHAD_DC_SIZE                      equ 0001h
STATUS_SHAD_DC_LENGTH                    equ 0001h
STATUS_SHAD_DC_MASK                      equ 0002h
STATUS_SHAD_Z_POSN                       equ 0002h
STATUS_SHAD_Z_POSITION                   equ 0002h
STATUS_SHAD_Z_SIZE                       equ 0001h
STATUS_SHAD_Z_LENGTH                     equ 0001h
STATUS_SHAD_Z_MASK                       equ 0004h
STATUS_SHAD_OV_POSN                      equ 0003h
STATUS_SHAD_OV_POSITION                  equ 0003h
STATUS_SHAD_OV_SIZE                      equ 0001h
STATUS_SHAD_OV_LENGTH                    equ 0001h
STATUS_SHAD_OV_MASK                      equ 0008h
STATUS_SHAD_N_POSN                       equ 0004h
STATUS_SHAD_N_POSITION                   equ 0004h
STATUS_SHAD_N_SIZE                       equ 0001h
STATUS_SHAD_N_LENGTH                     equ 0001h
STATUS_SHAD_N_MASK                       equ 0010h
STATUS_SHAD_nPD_POSN                     equ 0005h
STATUS_SHAD_nPD_POSITION                 equ 0005h
STATUS_SHAD_nPD_SIZE                     equ 0001h
STATUS_SHAD_nPD_LENGTH                   equ 0001h
STATUS_SHAD_nPD_MASK                     equ 0020h
STATUS_SHAD_nTO_POSN                     equ 0006h
STATUS_SHAD_nTO_POSITION                 equ 0006h
STATUS_SHAD_nTO_SIZE                     equ 0001h
STATUS_SHAD_nTO_LENGTH                   equ 0001h
STATUS_SHAD_nTO_MASK                     equ 0040h
STATUS_SHAD_PD_POSN                      equ 0005h
STATUS_SHAD_PD_POSITION                  equ 0005h
STATUS_SHAD_PD_SIZE                      equ 0001h
STATUS_SHAD_PD_LENGTH                    equ 0001h
STATUS_SHAD_PD_MASK                      equ 0020h
STATUS_SHAD_TO_POSN                      equ 0006h
STATUS_SHAD_TO_POSITION                  equ 0006h
STATUS_SHAD_TO_SIZE                      equ 0001h
STATUS_SHAD_TO_LENGTH                    equ 0001h
STATUS_SHAD_TO_MASK                      equ 0040h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 0378h
// bitfield definitions
WREG_SHAD_WREG_POSN                      equ 0000h
WREG_SHAD_WREG_POSITION                  equ 0000h
WREG_SHAD_WREG_SIZE                      equ 0008h
WREG_SHAD_WREG_LENGTH                    equ 0008h
WREG_SHAD_WREG_MASK                      equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 0379h

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 037Ah
// bitfield definitions
PCLATH_SHAD_PCH_POSN                     equ 0000h
PCLATH_SHAD_PCH_POSITION                 equ 0000h
PCLATH_SHAD_PCH_SIZE                     equ 0008h
PCLATH_SHAD_PCH_LENGTH                   equ 0008h
PCLATH_SHAD_PCH_MASK                     equ 00FFh

