GopalSaraf/Practicals/PSDL/include/proc/pic18f06q41.inc
// Register: NCO1ACCU
#define NCO1ACCU NCO1ACCU
NCO1ACCU                                 equ 0442h
// bitfield definitions
NCO1ACCU_ACC_POSN                        equ 0000h
NCO1ACCU_ACC_POSITION                    equ 0000h
NCO1ACCU_ACC_SIZE                        equ 0004h
NCO1ACCU_ACC_LENGTH                      equ 0004h
NCO1ACCU_ACC_MASK                        equ 000Fh
NCO1ACCU_NCO1ACC16_POSN                  equ 0000h
NCO1ACCU_NCO1ACC16_POSITION              equ 0000h
NCO1ACCU_NCO1ACC16_SIZE                  equ 0001h
NCO1ACCU_NCO1ACC16_LENGTH                equ 0001h
NCO1ACCU_NCO1ACC16_MASK                  equ 0001h
NCO1ACCU_NCO1ACC17_POSN                  equ 0001h
NCO1ACCU_NCO1ACC17_POSITION              equ 0001h
NCO1ACCU_NCO1ACC17_SIZE                  equ 0001h
NCO1ACCU_NCO1ACC17_LENGTH                equ 0001h
NCO1ACCU_NCO1ACC17_MASK                  equ 0002h
NCO1ACCU_NCO1ACC18_POSN                  equ 0002h
NCO1ACCU_NCO1ACC18_POSITION              equ 0002h
NCO1ACCU_NCO1ACC18_SIZE                  equ 0001h
NCO1ACCU_NCO1ACC18_LENGTH                equ 0001h
NCO1ACCU_NCO1ACC18_MASK                  equ 0004h
NCO1ACCU_NCO1ACC19_POSN                  equ 0003h
NCO1ACCU_NCO1ACC19_POSITION              equ 0003h
NCO1ACCU_NCO1ACC19_SIZE                  equ 0001h
NCO1ACCU_NCO1ACC19_LENGTH                equ 0001h
NCO1ACCU_NCO1ACC19_MASK                  equ 0008h
NCO1ACCU_ACC16_POSN                      equ 0000h
NCO1ACCU_ACC16_POSITION                  equ 0000h
NCO1ACCU_ACC16_SIZE                      equ 0001h
NCO1ACCU_ACC16_LENGTH                    equ 0001h
NCO1ACCU_ACC16_MASK                      equ 0001h
NCO1ACCU_ACC17_POSN                      equ 0001h
NCO1ACCU_ACC17_POSITION                  equ 0001h
NCO1ACCU_ACC17_SIZE                      equ 0001h
NCO1ACCU_ACC17_LENGTH                    equ 0001h
NCO1ACCU_ACC17_MASK                      equ 0002h
NCO1ACCU_ACC18_POSN                      equ 0002h
NCO1ACCU_ACC18_POSITION                  equ 0002h
NCO1ACCU_ACC18_SIZE                      equ 0001h
NCO1ACCU_ACC18_LENGTH                    equ 0001h
NCO1ACCU_ACC18_MASK                      equ 0004h
NCO1ACCU_ACC19_POSN                      equ 0003h
NCO1ACCU_ACC19_POSITION                  equ 0003h
NCO1ACCU_ACC19_SIZE                      equ 0001h
NCO1ACCU_ACC19_LENGTH                    equ 0001h
NCO1ACCU_ACC19_MASK                      equ 0008h
NCO1ACCU_NCO1ACC_POSN                    equ 0000h
NCO1ACCU_NCO1ACC_POSITION                equ 0000h
NCO1ACCU_NCO1ACC_SIZE                    equ 0004h
NCO1ACCU_NCO1ACC_LENGTH                  equ 0004h
NCO1ACCU_NCO1ACC_MASK                    equ 000Fh

// Register: NCO1INC
#define NCO1INC NCO1INC
NCO1INC                                  equ 0443h

// Register: NCO1INCL
#define NCO1INCL NCO1INCL
NCO1INCL                                 equ 0443h
// bitfield definitions
NCO1INCL_INC_POSN                        equ 0000h
NCO1INCL_INC_POSITION                    equ 0000h
NCO1INCL_INC_SIZE                        equ 0008h
NCO1INCL_INC_LENGTH                      equ 0008h
NCO1INCL_INC_MASK                        equ 00FFh
NCO1INCL_NCO1INC0_POSN                   equ 0000h
NCO1INCL_NCO1INC0_POSITION               equ 0000h
NCO1INCL_NCO1INC0_SIZE                   equ 0001h
NCO1INCL_NCO1INC0_LENGTH                 equ 0001h
NCO1INCL_NCO1INC0_MASK                   equ 0001h
NCO1INCL_NCO1INC1_POSN                   equ 0001h
NCO1INCL_NCO1INC1_POSITION               equ 0001h
NCO1INCL_NCO1INC1_SIZE                   equ 0001h
NCO1INCL_NCO1INC1_LENGTH                 equ 0001h
NCO1INCL_NCO1INC1_MASK                   equ 0002h
NCO1INCL_NCO1INC2_POSN                   equ 0002h
NCO1INCL_NCO1INC2_POSITION               equ 0002h
NCO1INCL_NCO1INC2_SIZE                   equ 0001h
NCO1INCL_NCO1INC2_LENGTH                 equ 0001h
NCO1INCL_NCO1INC2_MASK                   equ 0004h
NCO1INCL_NCO1INC3_POSN                   equ 0003h
NCO1INCL_NCO1INC3_POSITION               equ 0003h
NCO1INCL_NCO1INC3_SIZE                   equ 0001h
NCO1INCL_NCO1INC3_LENGTH                 equ 0001h
NCO1INCL_NCO1INC3_MASK                   equ 0008h
NCO1INCL_NCO1INC4_POSN                   equ 0004h
NCO1INCL_NCO1INC4_POSITION               equ 0004h
NCO1INCL_NCO1INC4_SIZE                   equ 0001h
NCO1INCL_NCO1INC4_LENGTH                 equ 0001h
NCO1INCL_NCO1INC4_MASK                   equ 0010h
NCO1INCL_NCO1INC5_POSN                   equ 0005h
NCO1INCL_NCO1INC5_POSITION               equ 0005h
NCO1INCL_NCO1INC5_SIZE                   equ 0001h
NCO1INCL_NCO1INC5_LENGTH                 equ 0001h
NCO1INCL_NCO1INC5_MASK                   equ 0020h
NCO1INCL_NCO1INC6_POSN                   equ 0006h
NCO1INCL_NCO1INC6_POSITION               equ 0006h
NCO1INCL_NCO1INC6_SIZE                   equ 0001h
NCO1INCL_NCO1INC6_LENGTH                 equ 0001h
NCO1INCL_NCO1INC6_MASK                   equ 0040h
NCO1INCL_NCO1INC7_POSN                   equ 0007h
NCO1INCL_NCO1INC7_POSITION               equ 0007h
NCO1INCL_NCO1INC7_SIZE                   equ 0001h
NCO1INCL_NCO1INC7_LENGTH                 equ 0001h
NCO1INCL_NCO1INC7_MASK                   equ 0080h
NCO1INCL_INC0_POSN                       equ 0000h
NCO1INCL_INC0_POSITION                   equ 0000h
NCO1INCL_INC0_SIZE                       equ 0001h
NCO1INCL_INC0_LENGTH                     equ 0001h
NCO1INCL_INC0_MASK                       equ 0001h
NCO1INCL_INC1_POSN                       equ 0001h
NCO1INCL_INC1_POSITION                   equ 0001h
NCO1INCL_INC1_SIZE                       equ 0001h
NCO1INCL_INC1_LENGTH                     equ 0001h
NCO1INCL_INC1_MASK                       equ 0002h
NCO1INCL_INC2_POSN                       equ 0002h
NCO1INCL_INC2_POSITION                   equ 0002h
NCO1INCL_INC2_SIZE                       equ 0001h
NCO1INCL_INC2_LENGTH                     equ 0001h
NCO1INCL_INC2_MASK                       equ 0004h
NCO1INCL_INC3_POSN                       equ 0003h
NCO1INCL_INC3_POSITION                   equ 0003h
NCO1INCL_INC3_SIZE                       equ 0001h
NCO1INCL_INC3_LENGTH                     equ 0001h
NCO1INCL_INC3_MASK                       equ 0008h
NCO1INCL_INC4_POSN                       equ 0004h
NCO1INCL_INC4_POSITION                   equ 0004h
NCO1INCL_INC4_SIZE                       equ 0001h
NCO1INCL_INC4_LENGTH                     equ 0001h
NCO1INCL_INC4_MASK                       equ 0010h
NCO1INCL_INC5_POSN                       equ 0005h
NCO1INCL_INC5_POSITION                   equ 0005h
NCO1INCL_INC5_SIZE                       equ 0001h
NCO1INCL_INC5_LENGTH                     equ 0001h
NCO1INCL_INC5_MASK                       equ 0020h
NCO1INCL_INC6_POSN                       equ 0006h
NCO1INCL_INC6_POSITION                   equ 0006h
NCO1INCL_INC6_SIZE                       equ 0001h
NCO1INCL_INC6_LENGTH                     equ 0001h
NCO1INCL_INC6_MASK                       equ 0040h
NCO1INCL_INC7_POSN                       equ 0007h
NCO1INCL_INC7_POSITION                   equ 0007h
NCO1INCL_INC7_SIZE                       equ 0001h
NCO1INCL_INC7_LENGTH                     equ 0001h
NCO1INCL_INC7_MASK                       equ 0080h
NCO1INCL_NCO1INC_POSN                    equ 0000h
NCO1INCL_NCO1INC_POSITION                equ 0000h
NCO1INCL_NCO1INC_SIZE                    equ 0008h
NCO1INCL_NCO1INC_LENGTH                  equ 0008h
NCO1INCL_NCO1INC_MASK                    equ 00FFh

// Register: NCO1INCH
#define NCO1INCH NCO1INCH
NCO1INCH                                 equ 0444h
// bitfield definitions
NCO1INCH_INC_POSN                        equ 0000h
NCO1INCH_INC_POSITION                    equ 0000h
NCO1INCH_INC_SIZE                        equ 0008h
NCO1INCH_INC_LENGTH                      equ 0008h
NCO1INCH_INC_MASK                        equ 00FFh
NCO1INCH_NCO1INC8_POSN                   equ 0000h
NCO1INCH_NCO1INC8_POSITION               equ 0000h
NCO1INCH_NCO1INC8_SIZE                   equ 0001h
NCO1INCH_NCO1INC8_LENGTH                 equ 0001h
NCO1INCH_NCO1INC8_MASK                   equ 0001h
NCO1INCH_NCO1INC9_POSN                   equ 0001h
NCO1INCH_NCO1INC9_POSITION               equ 0001h
NCO1INCH_NCO1INC9_SIZE                   equ 0001h
NCO1INCH_NCO1INC9_LENGTH                 equ 0001h
NCO1INCH_NCO1INC9_MASK                   equ 0002h
NCO1INCH_NCO1INC10_POSN                  equ 0002h
NCO1INCH_NCO1INC10_POSITION              equ 0002h
NCO1INCH_NCO1INC10_SIZE                  equ 0001h
NCO1INCH_NCO1INC10_LENGTH                equ 0001h
NCO1INCH_NCO1INC10_MASK                  equ 0004h
NCO1INCH_NCO1INC11_POSN                  equ 0003h
NCO1INCH_NCO1INC11_POSITION              equ 0003h
NCO1INCH_NCO1INC11_SIZE                  equ 0001h
NCO1INCH_NCO1INC11_LENGTH                equ 0001h
NCO1INCH_NCO1INC11_MASK                  equ 0008h
NCO1INCH_NCO1INC12_POSN                  equ 0004h
NCO1INCH_NCO1INC12_POSITION              equ 0004h
NCO1INCH_NCO1INC12_SIZE                  equ 0001h
NCO1INCH_NCO1INC12_LENGTH                equ 0001h
NCO1INCH_NCO1INC12_MASK                  equ 0010h
NCO1INCH_NCO1INC13_POSN                  equ 0005h
NCO1INCH_NCO1INC13_POSITION              equ 0005h
NCO1INCH_NCO1INC13_SIZE                  equ 0001h
NCO1INCH_NCO1INC13_LENGTH                equ 0001h
NCO1INCH_NCO1INC13_MASK                  equ 0020h
NCO1INCH_NCO1INC14_POSN                  equ 0006h
NCO1INCH_NCO1INC14_POSITION              equ 0006h
NCO1INCH_NCO1INC14_SIZE                  equ 0001h
NCO1INCH_NCO1INC14_LENGTH                equ 0001h
NCO1INCH_NCO1INC14_MASK                  equ 0040h
NCO1INCH_NCO1INC15_POSN                  equ 0007h
NCO1INCH_NCO1INC15_POSITION              equ 0007h
NCO1INCH_NCO1INC15_SIZE                  equ 0001h
NCO1INCH_NCO1INC15_LENGTH                equ 0001h
NCO1INCH_NCO1INC15_MASK                  equ 0080h
NCO1INCH_INC8_POSN                       equ 0000h
NCO1INCH_INC8_POSITION                   equ 0000h
NCO1INCH_INC8_SIZE                       equ 0001h
NCO1INCH_INC8_LENGTH                     equ 0001h
NCO1INCH_INC8_MASK                       equ 0001h
NCO1INCH_INC9_POSN                       equ 0001h
NCO1INCH_INC9_POSITION                   equ 0001h
NCO1INCH_INC9_SIZE                       equ 0001h
NCO1INCH_INC9_LENGTH                     equ 0001h
NCO1INCH_INC9_MASK                       equ 0002h
NCO1INCH_INC10_POSN                      equ 0002h
NCO1INCH_INC10_POSITION                  equ 0002h
NCO1INCH_INC10_SIZE                      equ 0001h
NCO1INCH_INC10_LENGTH                    equ 0001h
NCO1INCH_INC10_MASK                      equ 0004h
NCO1INCH_INC11_POSN                      equ 0003h
NCO1INCH_INC11_POSITION                  equ 0003h
NCO1INCH_INC11_SIZE                      equ 0001h
NCO1INCH_INC11_LENGTH                    equ 0001h
NCO1INCH_INC11_MASK                      equ 0008h
NCO1INCH_INC12_POSN                      equ 0004h
NCO1INCH_INC12_POSITION                  equ 0004h
NCO1INCH_INC12_SIZE                      equ 0001h
NCO1INCH_INC12_LENGTH                    equ 0001h
NCO1INCH_INC12_MASK                      equ 0010h
NCO1INCH_INC13_POSN                      equ 0005h
NCO1INCH_INC13_POSITION                  equ 0005h
NCO1INCH_INC13_SIZE                      equ 0001h
NCO1INCH_INC13_LENGTH                    equ 0001h
NCO1INCH_INC13_MASK                      equ 0020h
NCO1INCH_INC14_POSN                      equ 0006h
NCO1INCH_INC14_POSITION                  equ 0006h
NCO1INCH_INC14_SIZE                      equ 0001h
NCO1INCH_INC14_LENGTH                    equ 0001h
NCO1INCH_INC14_MASK                      equ 0040h
NCO1INCH_INC15_POSN                      equ 0007h
NCO1INCH_INC15_POSITION                  equ 0007h
NCO1INCH_INC15_SIZE                      equ 0001h
NCO1INCH_INC15_LENGTH                    equ 0001h
NCO1INCH_INC15_MASK                      equ 0080h
NCO1INCH_NCO1INC_POSN                    equ 0000h
NCO1INCH_NCO1INC_POSITION                equ 0000h
NCO1INCH_NCO1INC_SIZE                    equ 0008h
NCO1INCH_NCO1INC_LENGTH                  equ 0008h
NCO1INCH_NCO1INC_MASK                    equ 00FFh

